#Дано коло з центром на початку координат та радіусом 4. 
#Користувач вводить з клавіатури координати точки x та y. 
#Написати програму, яка визначить, лежить ця точка всередині кола чи ні.
x, y  = int(input('x=')), int(input('y='))
d = (x **2 + y ** 2) ** 0.5
R = 4


if d <R:
    print('In')
elif d == R:
    print('On')
else:
    print('Out')